fuerte656/esp32c6-water-meter/sdkconfig.defaults
# =================================================================
# ESP32-C6 Zigbee Water Meter - sdkconfig.defaults (USB / Router)
# =================================================================
#
# Default config: mains-powered, runs as Zigbee Router. This is the
# baseline for all builds.
#
# For battery / End Device builds, ALSO include
# sdkconfig.defaults.battery (see README), which overrides
# CONFIG_ZB_ZCZR with CONFIG_ZB_ZED and enables sleep features.
# =================================================================

# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bigger main task stack (Zigbee stack is hungry)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# ---- Zigbee ------------------------------------------------------
# Match exactly what the Espressif Zigbee router examples use.
# Don't disable WiFi or COEX manually - they interact with internal
# RF power management on C6 and disabling COEX has been observed to
# break IEEE 802.15.4 transmission on some IDF versions. BT is off
# by IDF default and stays off.
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y
CONFIG_ZB_RADIO_NATIVE=y

# Use mbedtls for security (matches the examples)
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y

# IEEE 802.15.4
CONFIG_IEEE802154_ENABLED=y

# PHY init data in partition (required for IEEE 802.15.4)
CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION=y

# Full newlib formatting so %llu works in log messages
# CONFIG_NEWLIB_NANO_FORMAT is not set

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
